# Початковий код (source code) — це набір фраз, слів і спеціальних символів, 
# специфічних для мови програмування, що описують набір інструкцій для комп'ютера.

print("Hello World!")

# Основні характеристики Python

# Основні характеристики Python включають:

# 1. Читабельність і простота

# Python має простий та інтуїтивно зрозумілий синтаксис, який робить його доступним для новачків. Він підтримує як процедурне, так і об'єктно-орієнтоване програмування.

# 2. Інтерпретована мова

# Код Python виконується рядок за рядком, що спрощує налагодження та тестування.

# 3. Динамічна типізація

# У Python не потрібно заздалегідь оголошувати типи змінних; тип визначається автоматично під час виконання програми.

# 4. Універсальність

# Python застосовується в широкому спектрі галузей, від веброзробки до наукових досліджень, від аналізу даних до штучного інтелекту.

# 5. Велика стандартна бібліотека

# Python поставляється зі стандартною бібліотекою, яка включає широкий набір інструментів для різних завдань. Фактично це швейцарський ніж для програмування.

# 6. Спільнота та підтримка

# Python має одну з найбільших і найактивніших спільнот серед мов програмування, що сприяє поширенню великої кількості ресурсів, бібліотек та інструментів.

# Введення (отримання даних)
name = input("Введіть ваше ім'я: ")

# Перетворення (обробка даних)
greeting = f"Привіт, {name}!"

# Виведення (виведення даних)
print(greeting)

# Змінна — це елемент пам'яті, у якого є ім'я і в якому можуть зберігатися дані.

age = 20
user_name = "Boris"
user_age = 30
ADULT_THR = 18

# Мова Python має наступний перелік зарезервованих слів: 
# False, None, True, and, as, assert, async, await, break, class, continue, def, del, elif, else, except, finally, for, from, global, if, import, in, is, lambda, nonlocal, not, or, pass, raise, return, try, while, with, yield. 
# Ми вивчимо ці оператори протягом курсу, але запам'ятай, що використовувати їх як ім'я для змінної не можна.